link = "website-kzn.ru"

start_message="""
📌 Продолжая отвечать на вопросы бота, вы соглашаетесь на 
обработку персональных данных согласно политике 
конфиденциальности. 
"""

hello_message =("""
Приветствуем! Мы строим дома под ключ:
🧱 Кирпичные | 🌳 Каркасные | 🏠 Модульные 

Давайте подберём для вас лучший вариант. Ответьте на 
несколько коротких вопросов — это займёт 1–2 минуты 🙌
""")


examples_message = """
📸 Вот примеры наших реализованных проектов: 
👉 <a href='website-kzn.ru'>Посмотреть</a>

Продолжим подбор?
"""

brick_message = """
🧱 Кирпичные дома — это долговечность, прочность и 
классический внешний вид. 
Отлично подходят для постоянного проживания. 

✅ Срок службы: 50+ лет
✅ Тепло- и шумоизоляция
✅ Возможность нестандартной архитектуры

Продолжим?
"""

frame_message = """
🌳 Каркасные дома — тёплые, энергоэффективные, быстро 
строятся.

✅ Строим от 3 месяцев
✅ Экономия на отоплении
✅ Гарантия 10 лет

Продолжим?
"""

module_message = """
🏠 Модульные дома — современное решение для дачи или 
постоянного проживания. 
Собираются на участке за считанные дни.

✅ Минимум подготовки
✅ Быстрый монтаж
✅ Можно перевезти

Продолжим?
"""

contacts_message = """
Почти готово! Оставьте, пожалуйста, ваши контактные данные 
— мы свяжемся и проконсультируем вас: 

📱 Введите номер телефона: 
"""

undecided_message = """
Ничего страшного! Мы поможем подобрать оптимальный тип по бюджету и задачам.

Перейдём к следующему вопросу?
"""